app/controllers/statuses_controller.rb

SELECT "statuses".* FROM "statuses" ORDER BY "statuses"."created_at" DESC
---
  def index
    @likes = Status.all.order(created_at: :desc)

INSERT INTO "statuses" ("sat_id", "depth", "risk", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["sat_id", 1], ["depth", 25.0], ["risk", 40.1], ["created_at", "2017-11-20 00:46:10.539158"], ["updated_at", "2017-11-20 00:46:10.539158"]]
---
  def create
    @like = Status.new(status_params)
    @like.save()

SELECT  "statuses".* FROM "statuses" WHERE (sat_id = '1') ORDER BY "statuses"."created_at" DESC LIMIT ?  [["LIMIT", 1]]
---
  def status_by_source
    @likes = Status.all